riraosan/ESP32_LEDMatrix_Clock/src/main.cpp
void shift_bit_left(uint8_t dist[], uint8_t src[], int len, int n)
{
    uint8_t mask = 0xFF << (8 - n);
    for (int i = 0; i < len; i++)
    {
        if (i < len - 1)
        {
            dist[i] = (src[i] << n) | ((src[i + 1] & mask) >> (8 - n));
        }
        else
        {
            dist[i] = src[i] << n;
        }
    }
}

void shift_color_left(uint8_t dist[], uint8_t src[], int len)
{
    for (int i = 0; i < len * 8; i++)
    {
        if (i < len * 8 - 1)
        {
            dist[i] = src[i + 1];
        }
        else
        {
            dist[i] = 0;
        }
    }
}
////////////////////////////////////////////////////////////////////
void scrollLEDMatrix(int16_t sj_length, uint8_t font_data[][16], uint8_t color_data[], uint16_t intervals)
{
    uint8_t src_line_data[sj_length] = {0};
    uint8_t dist_line_data[sj_length] = {0};
    uint8_t tmp_color_data[sj_length * 8] = {0};
    uint8_t tmp_font_data[sj_length][16] = {0};
    uint8_t ram = LOW;

    int n = 0;
    for (int i = 0; i < sj_length; i++)
    {
        for (int j = 0; j < 8; j++)
        {
            tmp_color_data[n++] = color_data[i];
        }

        for (int j = 0; j < 16; j++)
        {
            tmp_font_data[i][j] = font_data[i][j];
        }
    }

    for (int k = 0; k < sj_length * 8 + 2; k++)
    {
        ram = ~ram;
        digitalWrite(PORT_AB_IN, ram); //write to RAM-A/RAM-B
        for (int i = 0; i < 16; i++)
        {
            for (int j = 0; j < sj_length; j++)
            {
                src_line_data[j] = tmp_font_data[j][i];
            }

            send_line_data(i, src_line_data, tmp_color_data);
            shift_bit_left(dist_line_data, src_line_data, sj_length, 1);

            for (int j = 0; j < sj_length; j++)
            {
                tmp_font_data[j][i] = dist_line_data[j];
            }
        }
        shift_color_left(tmp_color_data, tmp_color_data, sj_length);
        delay(intervals);
    }
}

//Print static
void printLEDMatrix(uint16_t sj_length, uint8_t font_data[][16], uint8_t color_data[])
{
    uint8_t src_line_data[sj_length] = {0};
    uint8_t tmp_color_data[sj_length * 8] = {0};
    uint8_t tmp_font_data[sj_length][16] = {0};
    uint8_t ram = LOW;

    int n = 0;
    for (int i = 0; i < sj_length; i++)
    {
        for (int j = 0; j < 8; j++)
        {
            tmp_color_data[n++] = color_data[i];
        }

        for (int j = 0; j < 16; j++)
        {
            tmp_font_data[i][j] = font_data[i][j];
        }
    }

    for (int k = 0; k < sj_length * 8 + 2; k++)
    {
        digitalWrite(PORT_AB_IN, ram); //write to RAM-A/RAM-B
        for (int i = 0; i < 16; i++)
        {
            for (int j = 0; j < sj_length; j++)
            {
                src_line_data[j] = tmp_font_data[j][i];
            }

            send_line_data(i, src_line_data, tmp_color_data);
        }
        ram = ~ram;
    }
}

void setAllPortOutput()
{
    pinMode(PORT_SE_IN, OUTPUT);
    pinMode(PORT_AB_IN, OUTPUT);
    pinMode(PORT_A3_IN, OUTPUT);
    pinMode(PORT_A2_IN, OUTPUT);
    pinMode(PORT_A1_IN, OUTPUT);
    pinMode(PORT_A0_IN, OUTPUT);
    pinMode(PORT_DG_IN, OUTPUT);
    pinMode(PORT_CLK_IN, OUTPUT);
    pinMode(PORT_WE_IN, OUTPUT);
    pinMode(PORT_DR_IN, OUTPUT);
    pinMode(PORT_ALE_IN, OUTPUT);
}

void setAllPortLow()
{
    //digitalWrite(PORT_SE_IN, LOW);
    digitalWrite(PORT_AB_IN, LOW);
    digitalWrite(PORT_A3_IN, LOW);
    digitalWrite(PORT_A2_IN, LOW);
    digitalWrite(PORT_A1_IN, LOW);
    digitalWrite(PORT_A0_IN, LOW);
    digitalWrite(PORT_DG_IN, LOW);
    digitalWrite(PORT_CLK_IN, LOW);
    digitalWrite(PORT_WE_IN, LOW);
    digitalWrite(PORT_DR_IN, LOW);
    digitalWrite(PORT_ALE_IN, LOW);
}

void setAllPortHigh()
{
    digitalWrite(PORT_SE_IN, HIGH);
    digitalWrite(PORT_AB_IN, HIGH);
    digitalWrite(PORT_A3_IN, HIGH);
    digitalWrite(PORT_A2_IN, HIGH);
    digitalWrite(PORT_A1_IN, HIGH);
    digitalWrite(PORT_A0_IN, HIGH);
    digitalWrite(PORT_DG_IN, HIGH);
    digitalWrite(PORT_CLK_IN, HIGH);
    digitalWrite(PORT_WE_IN, HIGH);
    digitalWrite(PORT_DR_IN, HIGH);
    digitalWrite(PORT_ALE_IN, HIGH);
}

void PrintTime(String &str, int flag)
{
    char tmp_str[10] = {0};
    time_t t = time(NULL);
    struct tm *tm = localtime(&t);

    if (flag == 0)
    {
        sprintf(tmp_str, "%02d:%02d:%02d", tm->tm_hour, tm->tm_min, tm->tm_sec);
    }
    else
    {
        sprintf(tmp_str, "%02d:%02d:%02d", tm->tm_hour, tm->tm_min, tm->tm_sec);
    }

    str = tmp_str;
}

void printTimeLEDMatrix()
{
    static int flag = 0;
    String str;
    uint8_t time_font_buf[8][16] = {0};
    uint8_t time_font_color[8] = {G, G, O, G, G, O, G, G};

    flag = ~flag;
    PrintTime(str, flag);

    uint16_t sj_length = SFR.StrDirect_ShinoFNT_readALL(str, time_font_buf);
    printLEDMatrix(sj_length, time_font_buf, time_font_color);
}

void blink()
{
    printTimeLEDMatrix();
}

void connecting()
{
    uint16_t sj_length = 0;
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, O};

    static int num = 0;

    num = ~num;

    if (num)
    {
        sj_length = SFR.StrDirect_ShinoFNT_readALL("init   .", _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
    else
    {
        sj_length = SFR.StrDirect_ShinoFNT_readALL("init    ", _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
}

void printConnected()
{
    uint16_t sj_length = 0;
    uint8_t font_buf[32][16] = {0};
    uint8_t font_color1[32] = {G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G, G};

    sj_length = SFR.StrDirect_ShinoFNT_readALL(MSG_CONNECTED, font_buf);
    scrollLEDMatrix(sj_length, font_buf, font_color1, 30);

    sj_length = SFR.StrDirect_ShinoFNT_readALL("        " + WiFi.localIP().toString(), font_buf);
    scrollLEDMatrix(sj_length, font_buf, font_color1, 30);
}

void print_blank()
{
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, G};
    printLEDMatrix(8, _font_buf, _font_color);
}

void clearLEDMatrix()
{
    print_blank();
    print_blank();
}

void printStatic(String str)
{
    uint8_t _font_buf[8][16] = {0};
    uint8_t _font_color[8] = {G, G, G, G, G, G, G, G};

    if (str.length() < 9)
    {
        log_i("str : %s", str.c_str());
        uint16_t sj_length = SFR.StrDirect_ShinoFNT_readALL(str, _font_buf);
        printLEDMatrix(sj_length, _font_buf, _font_color);
    }
    else
    {
        log_e("couldn't set string. string length : %d", str.length());
    }
}

void initFont()
{
    SFR.SPIFFS_Shinonome_Init3F(UTF8SJIS_FILE.c_str(), SHINO_HALF_FONT_FILE.c_str(), DUMMY.c_str());
}

void initLEDMatrix()
{
    initFont();

    setAllPortOutput();

    digitalWrite(PORT_SE_IN, HIGH); //to change manual mode

    print_blank();
    print_blank();
}

bool check_clock_enable(uint8_t start_hour, uint8_t end_hour)
{
    time_t t = time(NULL);
    struct tm *tm = localtime(&t);

